上周那个提成的讨论需要的分析表格，
1.福州4月实际的销售人员提成，具体到人及客户，能看到负责部队的与其他行业的人员提成情况
2.在1的基础上，不进行签呈逾期调整的销售人员提成 
3.福州4月销售提成按单个客户计算，不豁免逾期，按单个收入及毛利额提成，负毛利扣减提成 
4.在3的基础上，按4月至今每个客户的回款情况所需的提成发放情况，5月内回款全额发放，6月打9折，7月打8折，8月打7折，9月及以后回款无提成


对应以上4点的确认
1、4月福州提成，当时第一次有服务管家概念，最后有给过一批客户的服务管家情况手动处理，此次分析能否统一按照所有客户提成给到销售员不给服务管家测算方便对比
2、√
3、负毛利扣减提成，是指某客户前端毛利1000元，前端毛利提成1000*10%=100元，而前端毛利-1000元则前端毛利提成-100元对么
4、两个疑问：
①如某客户4月销售10000，退货2000，4月总销售额8000元，按照订单核销，5月可能核销正向单共核销9000元，此时按照最大销售8000元处理么
②上述客户5月核销完成所有单据并拿到提成，7月冲销其中6000元并重新核销，需考虑如何能识别是否冲销后重新核销的


结论
1、可以不考虑服务管家，直接都算到销售员头上，方便每一版对比
2、①原版考虑签呈但都算到销售员头上调整一版；
   ②不考虑签呈逾期算一版；
   ③按客户逾期且不考虑签呈逾期，负毛利扣减计算一版；
   ④按客户不考虑签逾期呈且毛利扣减，并按回款发提成算一版
3、以上四版对比，客户明细且带行业

疑问：销售额提成+前端毛利提成总额为负数的 需要算为负提成还是0？











1、每周日指发送3号文件：“03 每客户每商品表20210110”
2、平日不定期的可能需要发送近7日及环比：“03 每客户每商品表近7天环比”
3、其他若有特殊时间对比可根据第一点中的代码调相应时间
4、1-2、4-6号文件均已上到帆软，以数据中心最新为准
5、“05、06文件日报线上化”文件夹中文件“指定客户业绩跟踪 20210812”对应数据中心-毛利率优化专题-客户专题-省区重点客户毛利，
   每月由产品运营牛瑞波提供新的客户清单，提供后替换导入到csx_tmp.sales_customer_qingdan中生效




