-- 由于标识错误 需剔除部分客户：'118849','118365','114646','118215','120645','115237','113387'
-- 销售主管激励案_Q3福利激励案_Q3福利毛利额 定价毛利额改为前端毛利额 20210906 
-- 贺仕文由销售员更改为主管
-- 20210918 去掉公司招标客户
-- 20211112 去掉部分客户
-- 20211213 去掉部分客户

--==================================================================================================================================================================================
--set current_start_day ='20210701';

--set current_end_day ='20211231';

--===================================================================================================================================================================
-- 销售员明细

insert overwrite directory '/tmp/zhangyanpeng/20210813_13' row format delimited fields terminated by '\t'

select	
	b.sales_province_name,a.customer_no,b.customer_name,a.work_no,a.sales_name,
	a.business_type_name,a.sales_value,a.profit,a.front_profit,a.profit_rate,a.front_profit_rate
from
	(
	select
		customer_no,work_no,sales_name,
		business_type_name,
		sum(sales_value) as sales_value, --含税销售额
		sum(profit) as profit, --含税毛利额
		sum(front_profit) as front_profit, --前端含税毛利
		sum(profit)/abs(sum(sales_value)) as profit_rate,
		sum(front_profit)/abs(sum(sales_value)) as front_profit_rate
	from 
		csx_dw.dws_sale_r_d_detail
	where 
		sdt between '20210701' and '20211231'
		and channel_code in ('1','7','9') 
		and business_type_code in ('1')
		--and supervisor_work_no !=''
		and customer_no not in ('118849','118365','114646','118215','120645','115237','113387') --剔除部分客户
		-- 20210918 剔除部分客户
		and customer_no not in ('117529','118693','118892','118897','118907','118911','118912','118913','118915','118918','119032','120123','121015','120704','119925','110931',
		'112735','118136','116205','117015','115936','109544','112088','108105','108201','110898','106306','106320','106330','106298','106325','117108','106321','106326','106283',
		'106299','106309','120024','119990','106805','118072') -- 20210918 剔除部分客户
		-- 20210923 剔除部分客户
		and customer_no not in ('121112','121109','120666','120360','110807','110807','110807','110807','110807','115971','120360','117255','117814','110807','115643')
		and order_no not in (
		'OM21092500022852','OM21092500018389','OM21091600021970','OM21091800011804','OM21093000003441','OM21081800009334','OM21073000033690','OM21081800016201',
		'OM21072800045844','OM21072700002361','OM21072800045333','OM21072700002378','OM21072700002277','OM21072700002338','OM21091100000260','OM21082300007563')
		-- 20211012 剔除部分客户
		and customer_no not in ('122230','115300','117197','121880','109529','121574')
		-- 20211101 剔除部分客户
		and customer_no not in ('116984','117222','117008','117222','102866','116999','115188','PF0937','112409','119853','102202','105886','120362','119906','102867',
		'104324','104478','117852','106719','115760','111574','PF0085','108367','111365','104875')
			-- 20211112 剔除部分客户
			and customer_no not in ('122887','117226','122620','122738','122852','122781','121389','115852','121507','106587')
			-- 20211213 剔除部分客户
			and customer_no not in ('123100','123096','123101','123136','123106','123135','123105','122341','123035','122614','107956','122579','122590','122626','122613',
			'122600','122618','122581','122605','120607','123158','122619','121468','115781','122564','122612','122322','122622','122469','122595','122695')
			-- 20220110 剔除部分客户和订单
			and customer_no not in ('115899')
			and order_no not in ('OM21120200001035','OM21120200001239','2112300602006417','OM21122700005008','2112020601898724','OM21122300006741','2112070601917716',
			'2112070601918496','RH21121100000063','RH21121100000056','OM21122300006927','2112040601908027','RH21121400000262','2112280601995236','OM21120200001397',
			'2112270601989044','2112180601962455','OM21120200001418','OM21120200000781','2112030601902061','2112230601976793','OM21122300007379','2112020601899461',
			'OM21120800002328','OM21122100009074','OM21122300006691','OM21122100008922','OM21122800031667','OM21122300007075','2112280601995235','OM21122100009281',
			'OC21121600000114','2112070601918497','RH21122500000080','2112200601967539','2112060601914207','OM21122300006806','OM21122700005079','2112070601917717',
			'2112200601966676','RH21121100000061','OC21121600000115','2112080601922167','2112010601894433','2112200601966677','2112020601898723','OM21120900001784',
			'OM21120300013306','OM21121500023007','RH21121500000705','OM21122100009227','2112280601997164','OM21122300007274','OM21122300006620','OM21120200000956',
			'RH21121100000067','OM21120200001275','2112290602001541','OM21122300006894')
			and work_no in ('80948175','80980614','80924363','80991769','80901735','80895349','80948202','80939618','80930345','81010913','80007454','80961539','81055717',
			'80895350','80890403','80989132','81039868','80927692','80887010','80857686','80956511','80927693','80970937','80929704','80912842','80978840','81055718',
			'80887786','81024326','80971382','81087440','81129006','81103065','80927653','80913079','80793145','80971545','81093604','81042140','80928776','80913408',
			'80939468','81079932','80929710','80902387','81111210','81081169','81022577','80404654','81027603','80929962','81089088','81126138','81062397','80886777',
			'81096879','80980678','80861525','81084686','81095986')
	group by
		customer_no,work_no,sales_name,business_type_name
	) a 
	left join
		(
		select
			customer_no,customer_name,work_no,sales_name,
			if(work_no='81095965',work_no,first_supervisor_work_no) as first_supervisor_work_no,
			if(work_no='81095965',sales_name,first_supervisor_name) as first_supervisor_name,
			sales_province_name
		from 
			csx_dw.dws_crm_w_a_customer
		where
			sdt='current'
		) b on b.customer_no=a.customer_no
;

--===================================================================================================================================================================
-- 销售主管明细

insert overwrite directory '/tmp/zhangyanpeng/20210813_14' row format delimited fields terminated by '\t'

select	
	b.sales_province_name,a.customer_no,b.customer_name,a.supervisor_work_no,a.supervisor_name,
	a.business_type_name,a.sales_value,a.profit,a.front_profit,a.profit_rate,a.front_profit_rate
from
	(
	select
		customer_no,supervisor_work_no,supervisor_name,
		business_type_name,
		sum(sales_value) as sales_value, --含税销售额
		sum(profit) as profit, --含税毛利额
		sum(front_profit) as front_profit, --前端含税毛利
		sum(profit)/abs(sum(sales_value)) as profit_rate,
		sum(front_profit)/abs(sum(sales_value)) as front_profit_rate
	from 
		csx_dw.dws_sale_r_d_detail
	where 
		sdt between '20210701' and '20211231'
		and channel_code in ('1','7','9') 
		and business_type_code in ('1','2','6')
		--and supervisor_work_no !=''
		and customer_no not in ('118849','118365','114646','118215','120645','115237','113387') --剔除部分客户
		-- 20210918 剔除部分客户
		and customer_no not in ('117529','118693','118892','118897','118907','118911','118912','118913','118915','118918','119032','120123','121015','120704','119925','110931',
		'112735','118136','116205','117015','115936','109544','112088','108105','108201','110898','106306','106320','106330','106298','106325','117108','106321','106326','106283',
		'106299','106309','120024','119990','106805','118072') -- 20210918 剔除部分客户
		-- 20210923 剔除部分客户
		and customer_no not in ('121112','121109','120666','120360','110807','110807','110807','110807','110807','115971','120360','117255','117814','110807','115643')
		and order_no not in (
		'OM21092500022852','OM21092500018389','OM21091600021970','OM21091800011804','OM21093000003441','OM21081800009334','OM21073000033690','OM21081800016201',
		'OM21072800045844','OM21072700002361','OM21072800045333','OM21072700002378','OM21072700002277','OM21072700002338','OM21091100000260','OM21082300007563')
		-- 20211012 剔除部分客户
		and customer_no not in ('122230','115300','117197','121880','109529','121574')
		-- 20211101 剔除部分客户
		and customer_no not in ('116984','117222','117008','117222','102866','116999','115188','PF0937','112409','119853','102202','105886','120362','119906','102867',
		'104324','104478','117852','106719','115760','111574','PF0085','108367','111365','104875')
			-- 20211112 剔除部分客户
			and customer_no not in ('122887','117226','122620','122738','122852','122781','121389','115852','121507','106587')
			-- 20211213 剔除部分客户
			and customer_no not in ('123100','123096','123101','123136','123106','123135','123105','122341','123035','122614','107956','122579','122590','122626','122613',
			'122600','122618','122581','122605','120607','123158','122619','121468','115781','122564','122612','122322','122622','122469','122595','122695')
			-- 20220110 剔除部分客户和订单
			and customer_no not in ('115899')
			and order_no not in ('OM21120200001035','OM21120200001239','2112300602006417','OM21122700005008','2112020601898724','OM21122300006741','2112070601917716',
			'2112070601918496','RH21121100000063','RH21121100000056','OM21122300006927','2112040601908027','RH21121400000262','2112280601995236','OM21120200001397',
			'2112270601989044','2112180601962455','OM21120200001418','OM21120200000781','2112030601902061','2112230601976793','OM21122300007379','2112020601899461',
			'OM21120800002328','OM21122100009074','OM21122300006691','OM21122100008922','OM21122800031667','OM21122300007075','2112280601995235','OM21122100009281',
			'OC21121600000114','2112070601918497','RH21122500000080','2112200601967539','2112060601914207','OM21122300006806','OM21122700005079','2112070601917717',
			'2112200601966676','RH21121100000061','OC21121600000115','2112080601922167','2112010601894433','2112200601966677','2112020601898723','OM21120900001784',
			'OM21120300013306','OM21121500023007','RH21121500000705','OM21122100009227','2112280601997164','OM21122300007274','OM21122300006620','OM21120200000956',
			'RH21121100000067','OM21120200001275','2112290602001541','OM21122300006894')
			and supervisor_work_no in ('80768089','81014292','80946212','80980888','80958649','80764642','81051686','80886641','81013168','80912701','80160212','80887605',
			'80928577','81002220','80941184')
	group by
		customer_no,supervisor_work_no,supervisor_name,business_type_name
	) a 
	left join
		(
		select
			customer_no,customer_name,work_no,sales_name,
			if(work_no='81095965',work_no,first_supervisor_work_no) as first_supervisor_work_no,
			if(work_no='81095965',sales_name,first_supervisor_name) as first_supervisor_name,
			sales_province_name
		from 
			csx_dw.dws_crm_w_a_customer
		where
			sdt='current'
		) b on b.customer_no=a.customer_no
;

-- 销售员的客户明细
insert overwrite directory '/tmp/zhangyanpeng/20220218_01' row format delimited fields terminated by '\t'

select	
	b.sales_province_name,a.smonth,a.customer_no,b.customer_name,a.supervisor_work_no,a.supervisor_name,
	a.business_type_name,b.sign_date,a.sales_value,a.profit,a.front_profit,a.profit_rate,a.front_profit_rate
from
	(
	select
		substr(sdt,1,6) as smonth,
		customer_no,supervisor_work_no,supervisor_name,
		business_type_name,
		sum(sales_value) as sales_value, --含税销售额
		sum(profit) as profit, --含税毛利额
		sum(front_profit) as front_profit, --前端含税毛利
		sum(profit)/abs(sum(sales_value)) as profit_rate,
		sum(front_profit)/abs(sum(sales_value)) as front_profit_rate
	from 
		csx_dw.dws_sale_r_d_detail
	where 
		sdt between '20210801' and '20220131'
		and channel_code in ('1','7','9') 
		--and business_type_code in ('1','2','6')
	group by
		substr(sdt,1,6),customer_no,supervisor_work_no,supervisor_name,business_type_name
	) a 
	join
		(
		select
			customer_no,customer_name,work_no,sales_name,first_supervisor_work_no,first_supervisor_name,sales_province_name,
			regexp_replace(substr(sign_time,1,10),'-','') as sign_date
		from 
			csx_dw.dws_crm_w_a_customer
		where
			sdt='current'
			and work_no='81111615'
			and regexp_replace(substr(sign_time,1,10),'-','')>='20210801'
		) b on b.customer_no=a.customer_no